{
	"title": "Introduction | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/get_started/introduction",
	"html": "Skip to main content\n🦜️🔗 LangChain\nDocs\nUse cases\nIntegrations\nGuides\nAPI\nMore\n🦜️🔗\nChat\nSearch\n⌘\nK\nGet started\nIntroduction\nInstallation\nQuickstart\nSecurity\nLangChain Expression Language\nGet started\nWhy use LCEL\nInterface\nHow to\nCookbook\nModules\nModel I/O\nRetrieval\nAgents\nMore\nLangServe\nLangSmith\nGet startedIntroduction\nIntroduction\n\nLangChain is a framework for developing applications powered by language models. It enables applications that:\n\nAre context-aware: connect a language model to sources of context (prompt instructions, few shot examples, content to ground its response in, etc.)\nReason: rely on a language model to reason (about how to answer based on provided context, what actions to take, etc.)\n\nThis framework consists of several parts.\n\nLangChain Libraries: The Python and JavaScript libraries. Contains interfaces and integrations for a myriad of components, a basic run time for combining these components into chains and agents, and off-the-shelf implementations of chains and agents.\nLangChain Templates: A collection of easily deployable reference architectures for a wide variety of tasks.\nLangServe: A library for deploying LangChain chains as a REST API.\nLangSmith: A developer platform that lets you debug, test, evaluate, and monitor chains built on any LLM framework and seamlessly integrates with LangChain.\n\nTogether, these products simplify the entire application lifecycle:\n\nDevelop: Write your applications in LangChain/LangChain.js. Hit the ground running using Templates for reference.\nProductionize: Use LangSmith to inspect, test and monitor your chains, so that you can constantly improve and deploy with confidence.\nDeploy: Turn any chain into an API with LangServe.\nLangChain Libraries​\n\nThe main value props of the LangChain packages are:\n\nComponents: composable tools and integrations for working with language models. Components are modular and easy-to-use, whether you are using the rest of the LangChain framework or not\nOff-the-shelf chains: built-in assemblages of components for accomplishing higher-level tasks\n\nOff-the-shelf chains make it easy to get started. Components make it easy to customize existing chains and build new ones.\n\nGet started​\n\nHere’s how to install LangChain, set up your environment, and start building.\n\nWe recommend following our Quickstart guide to familiarize yourself with the framework by building your first LangChain application.\n\nRead up on our Security best practices to make sure you're developing safely with LangChain.\n\nNOTE\n\nThese docs focus on the Python LangChain library. Head here for docs on the JavaScript LangChain library.\n\nLangChain Expression Language (LCEL)​\n\nLCEL is a declarative way to compose chains. LCEL was designed from day 1 to support putting prototypes in production, with no code changes, from the simplest “prompt + LLM” chain to the most complex chains.\n\nOverview: LCEL and its benefits\nInterface: The standard interface for LCEL objects\nHow-to: Key features of LCEL\nCookbook: Example code for accomplishing common tasks\nModules​\n\nLangChain provides standard, extendable interfaces and integrations for the following modules:\n\nModel I/O​\n\nInterface with language models\n\nRetrieval​\n\nInterface with application-specific data\n\nAgents​\n\nLet models choose which tools to use given high-level directives\n\nExamples, ecosystem, and resources​\nUse cases​\n\nWalkthroughs and techniques for common end-to-end use cases, like:\n\nDocument question answering\nChatbots\nAnalyzing structured data\nand much more...\nIntegrations​\n\nLangChain is part of a rich ecosystem of tools that integrate with our framework and build on top of it. Check out our growing list of integrations.\n\nGuides​\n\nBest practices for developing with LangChain.\n\nAPI reference​\n\nHead to the reference section for full documentation of all classes and methods in the LangChain and LangChain Experimental Python packages.\n\nDeveloper's guide​\n\nCheck out the developer's guide for guidelines on contributing and help getting your dev environment set up.\n\nCommunity​\n\nHead to the Community navigator to find places to ask questions, share feedback, meet other developers, and dream about the future of LLM’s.\n\nPrevious\nGet started\nNext\nInstallation\nLangChain Libraries\nGet started\nLangChain Expression Language (LCEL)\nModules\nExamples, ecosystem, and resources\nUse cases\nIntegrations\nGuides\nAPI reference\nDeveloper's guide\nCommunity\nCommunity\nDiscord\nTwitter\nGitHub\nPython\nJS/TS\nMore\nHomepage\nBlog\nCopyright © 2023 LangChain, Inc."
}