{
	"title": "YouTube videos | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/additional_resources/youtube",
	"html": "Skip to main content\n🦜️🔗 LangChain\nDocs\nUse cases\nIntegrations\nGuides\nAPI\nMore\n🦜️🔗\nChat\nSearch\n⌘\nK\nYouTube videos\n\n⛓ icon marks a new addition [last update 2023-09-21]\n\nOfficial LangChain YouTube channel​\nIntroduction to LangChain with Harrison Chase, creator of LangChain​\nBuilding the Future with LLMs, LangChain, & Pinecone by Pinecone\nLangChain and Weaviate with Harrison Chase and Bob van Luijt - Weaviate Podcast #36 by Weaviate • Vector Database\nLangChain Demo + Q&A with Harrison Chase by Full Stack Deep Learning\nLangChain Agents: Build Personal Assistants For Your Data (Q&A with Harrison Chase and Mayo Oshin) by Chat with data\nVideos (sorted by views)​\nUsing ChatGPT with YOUR OWN Data. This is magical. (LangChain OpenAI API) by TechLead\nFirst look - ChatGPT + WolframAlpha (GPT-3.5 and Wolfram|Alpha via LangChain by James Weaver) by Dr Alan D. Thompson\nLangChain explained - The hottest new Python framework by AssemblyAI\nChatbot with INFINITE MEMORY using OpenAI & Pinecone - GPT-3, Embeddings, ADA, Vector DB, Semantic by David Shapiro ~ AI\nLangChain for LLMs is... basically just an Ansible playbook by David Shapiro ~ AI\nBuild your own LLM Apps with LangChain & GPT-Index by 1littlecoder\nBabyAGI - New System of Autonomous AI Agents with LangChain by 1littlecoder\nRun BabyAGI with Langchain Agents (with Python Code) by 1littlecoder\nHow to Use Langchain With Zapier | Write and Send Email with GPT-3 | OpenAI API Tutorial by StarMorph AI\nUse Your Locally Stored Files To Get Response From GPT - OpenAI | Langchain | Python by Shweta Lodha\nLangchain JS | How to Use GPT-3, GPT-4 to Reference your own Data | OpenAI Embeddings Intro by StarMorph AI\nThe easiest way to work with large language models | Learn LangChain in 10min by Sophia Yang\n4 Autonomous AI Agents: “Westworld” simulation BabyAGI, AutoGPT, Camel, LangChain by Sophia Yang\nAI CAN SEARCH THE INTERNET? Langchain Agents + OpenAI ChatGPT by tylerwhatsgood\nQuery Your Data with GPT-4 | Embeddings, Vector Databases | Langchain JS Knowledgebase by StarMorph AI\nWeaviate + LangChain for LLM apps presented by Erika Cardenas by Weaviate • Vector Database\nLangchain Overview — How to Use Langchain & ChatGPT by Python In Office\nLangchain Overview - How to Use Langchain & ChatGPT by Python In Office\nLangChain Tutorials by Edrick:\nLangChain, Chroma DB, OpenAI Beginner Guide | ChatGPT with your PDF\nLangChain 101: The Complete Beginner's Guide\nCustom langchain Agent & Tools with memory. Turn any Python function into langchain tool with Gpt 3 by echohive\nBuilding AI LLM Apps with LangChain (and more?) - LIVE STREAM by Nicholas Renotte\nChatGPT with any YouTube video using langchain and chromadb by echohive\nHow to Talk to a PDF using LangChain and ChatGPT by Automata Learning Lab\nLangchain Document Loaders Part 1: Unstructured Files by Merk\nLangChain - Prompt Templates (what all the best prompt engineers use) by Nick Daigler\nLangChain. Crear aplicaciones Python impulsadas por GPT by Jesús Conde\nEasiest Way to Use GPT In Your Products | LangChain Basics Tutorial by Rachel Woods\nBabyAGI + GPT-4 Langchain Agent with Internet Access by tylerwhatsgood\nLearning LLM Agents. How does it actually work? LangChain, AutoGPT & OpenAI by Arnoldas Kemeklis\nGet Started with LangChain in Node.js by Developers Digest\nLangChain + OpenAI tutorial: Building a Q&A system w/ own text data by Samuel Chan\nLangchain + Zapier Agent by Merk\nConnecting the Internet with ChatGPT (LLMs) using Langchain And Answers Your Questions by Kamalraj M M\nBuild More Powerful LLM Applications for Business’s with LangChain (Beginners Guide) by No Code Blackbox\nLangFlow LLM Agent Demo for 🦜🔗LangChain by Cobus Greyling\nChatbot Factory: Streamline Python Chatbot Creation with LLMs and Langchain by Finxter\nLangChain Tutorial - ChatGPT mit eigenen Daten by Coding Crashkurse\nChat with a CSV | LangChain Agents Tutorial (Beginners) by GoDataProf\nIntrodução ao Langchain - #Cortes - Live DataHackers by Prof. João Gabriel Lima\nLangChain: Level up ChatGPT !? | LangChain Tutorial Part 1 by Code Affinity\nKI schreibt krasses Youtube Skript 😲😳 | LangChain Tutorial Deutsch by SimpleKI\nChat with Audio: Langchain, Chroma DB, OpenAI, and Assembly AI by AI Anytime\nQA over documents with Auto vector index selection with Langchain router chains by echohive\nBuild your own custom LLM application with Bubble.io & Langchain (No Code & Beginner friendly) by No Code Blackbox\nSimple App to Question Your Docs: Leveraging Streamlit, Hugging Face Spaces, LangChain, and Claude! by Chris Alexiuk\nLANGCHAIN AI- ConstitutionalChainAI + Databutton AI ASSISTANT Web App by Avra\nLANGCHAIN AI AUTONOMOUS AGENT WEB APP - 👶 BABY AGI 🤖 with EMAIL AUTOMATION using DATABUTTON by Avra\nThe Future of Data Analysis: Using A.I. Models in Data Analysis (LangChain) by Absent Data\nMemory in LangChain | Deep dive (python) by Eden Marco\n9 LangChain UseCases | Beginner's Guide | 2023 by Data Science Basics\nUse Large Language Models in Jupyter Notebook | LangChain | Agents & Indexes by Abhinaw Tiwari\nHow to Talk to Your Langchain Agent | 11 Labs + Whisper by VRSEN\nLangChain Deep Dive: 5 FUN AI App Ideas To Build Quickly and Easily by James NoCode\nLangChain 101: Models by Mckay Wrigley\nLangChain with JavaScript Tutorial #1 | Setup & Using LLMs by Leon van Zyl\nLangChain Overview & Tutorial for Beginners: Build Powerful AI Apps Quickly & Easily (ZERO CODE) by James NoCode\nLangChain In Action: Real-World Use Case With Step-by-Step Tutorial by Rabbitmetrics\nSummarizing and Querying Multiple Papers with LangChain by Automata Learning Lab\nUsing Langchain (and Replit) through Tana, ask Google/Wikipedia/Wolfram Alpha to fill out a table by Stian Håklev\nLangchain PDF App (GUI) | Create a ChatGPT For Your PDF in Python by Alejandro AO - Software & Ai\nAuto-GPT with LangChain 🔥 | Create Your Own Personal AI Assistant by Data Science Basics\nCreate Your OWN Slack AI Assistant with Python & LangChain by Dave Ebbelaar\nHow to Create LOCAL Chatbots with GPT4All and LangChain [Full Guide] by Liam Ottley\nBuild a Multilingual PDF Search App with LangChain, Cohere and Bubble by Menlo Park Lab\nBuilding a LangChain Agent (code-free!) Using Bubble and Flowise by Menlo Park Lab\nBuild a LangChain-based Semantic PDF Search App with No-Code Tools Bubble and Flowise by Menlo Park Lab\nLangChain Memory Tutorial | Building a ChatGPT Clone in Python by Alejandro AO - Software & Ai\nChatGPT For Your DATA | Chat with Multiple Documents Using LangChain by Data Science Basics\nLlama Index: Chat with Documentation using URL Loader by Merk\nUsing OpenAI, LangChain, and Gradio to Build Custom GenAI Applications by David Hundley\nLangChain, Chroma DB, OpenAI Beginner Guide | ChatGPT with your PDF\nBuild AI chatbot with custom knowledge base using OpenAI API and GPT Index by Irina Nik\nBuild Your Own Auto-GPT Apps with LangChain (Python Tutorial) by Dave Ebbelaar\nChat with Multiple PDFs | LangChain App Tutorial in Python (Free LLMs and Embeddings) by Alejandro AO - Software & Ai\nChat with a CSV | LangChain Agents Tutorial (Beginners) by Alejandro AO - Software & Ai\nCreate Your Own ChatGPT with PDF Data in 5 Minutes (LangChain Tutorial) by Liam Ottley\nBuild a Custom Chatbot with OpenAI: GPT-Index & LangChain | Step-by-Step Tutorial by Fabrikod\nFlowise is an open-source no-code UI visual tool to build 🦜🔗LangChain applications by Cobus Greyling\nLangChain & GPT 4 For Data Analysis: The Pandas Dataframe Agent by Rabbitmetrics\nGirlfriendGPT - AI girlfriend with LangChain by Toolfinder AI\nHow to build with Langchain 10x easier | ⛓️ LangFlow & Flowise by AI Jason\nGetting Started With LangChain In 20 Minutes- Build Celebrity Search Application by Krish Naik\n⛓ Vector Embeddings Tutorial – Code Your Own AI Assistant with GPT-4 API + LangChain + NLP by FreeCodeCamp.org\n⛓ Fully LOCAL Llama 2 Q&A with LangChain by 1littlecoder\n⛓ Fully LOCAL Llama 2 Langchain on CPU by 1littlecoder\n⛓ Build LangChain Audio Apps with Python in 5 Minutes by AssemblyAI\n⛓ Voiceflow & Flowise: Want to Beat Competition? New Tutorial with Real AI Chatbot by AI SIMP\n⛓ THIS Is How You Build Production-Ready AI Apps (LangSmith Tutorial) by Dave Ebbelaar\n⛓ Build POWERFUL LLM Bots EASILY with Your Own Data - Embedchain - Langchain 2.0? (Tutorial) by WorldofAI\n⛓ Code Llama powered Gradio App for Coding: Runs on CPU by AI Anytime\n⛓ LangChain Complete Course in One Video | Develop LangChain (AI) Based Solutions for Your Business by UBprogrammer\n⛓ How to Run LLaMA Locally on CPU or GPU | Python & Langchain & CTransformers Guide by Code With Prince\n⛓ PyData Heidelberg #11 - TimeSeries Forecasting & LLM Langchain by PyData\n⛓ Prompt Engineering in Web Development | Using LangChain and Templates with OpenAI by Akamai Developer\n⛓ Retrieval-Augmented Generation (RAG) using LangChain and Pinecone - The RAG Special Episode by Generative AI and Data Science On AWS\n⛓ LLAMA2 70b-chat Multiple Documents Chatbot with Langchain & Streamlit |All OPEN SOURCE|Replicate API by DataInsightEdge\n⛓ Chatting with 44K Fashion Products: LangChain Opportunities and Pitfalls by Rabbitmetrics\n⛓ Structured Data Extraction from ChatGPT with LangChain by MG\n⛓ Chat with Multiple PDFs using Llama 2, Pinecone and LangChain (Free LLMs and Embeddings) by Muhammad Moin\n⛓ Integrate Audio into LangChain.js apps in 5 Minutes by AssemblyAI\n⛓ ChatGPT for your data with Local LLM by Jacob Jedryszek\n⛓ Training Chatgpt with your personal data using langchain step by step in detail by NextGen Machines\n⛓ Use ANY language in LangSmith with REST by Nerding I/O\n⛓ How to Leverage the Full Potential of LLMs for Your Business with Langchain - Leon Ruddat by PyData\n⛓ ChatCSV App: Chat with CSV files using LangChain and Llama 2 by Muhammad Moin\nPrompt Engineering and LangChain by Venelin Valkov​\nGetting Started with LangChain: Load Custom Data, Run OpenAI Models, Embeddings and ChatGPT\nLoaders, Indexes & Vectorstores in LangChain: Question Answering on PDF files with ChatGPT\nLangChain Models: ChatGPT, Flan Alpaca, OpenAI Embeddings, Prompt Templates & Streaming\nLangChain Chains: Use ChatGPT to Build Conversational Agents, Summaries and Q&A on Text With LLMs\nAnalyze Custom CSV Data with GPT-4 using Langchain\nBuild ChatGPT Chatbots with LangChain Memory: Understanding and Implementing Memory in Conversations\n\n⛓ icon marks a new addition [last update 2023-09-21]\n\nOfficial LangChain YouTube channel\nIntroduction to LangChain with Harrison Chase, creator of LangChain\nVideos (sorted by views)\nPrompt Engineering and LangChain by Venelin Valkov\nCommunity\nDiscord\nTwitter\nGitHub\nPython\nJS/TS\nMore\nHomepage\nBlog\nCopyright © 2023 LangChain, Inc."
}